src/main/test/supply-chain/3-Calculation/0-Apply Tax/8-Tax Amounts/15-TC.03.07.11 - Same_TI,TT,TC,TR_between_Selle-Buyer_TR=NULL/0-TC.03.07.11 - Same_TI,TT,TC,TR_between_Selle-Buyer_TR=NULL/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ws="http://ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <ws:applyTax><!--Optional:-->
  <arg0><DocumentId>
    <SystemSourceId>ICI001</SystemSourceId>
    <TransactionId/>
  </DocumentId>
  <AlternateDocumentId>
    <CustomField1>CUSTOM_01</CustomField1>
    <CustomField2/>
    <CustomField3/>
    <CustomField4/>
    <CustomField5/>
    <CustomField6/>
    <CustomField7/>
    <CustomField8/>
    <CustomField9/>
    <CustomField10/>
  </AlternateDocumentId>
  <InvoiceLanguage>
    <LanguageCode>en</LanguageCode>
    <LanguageCountryCode>GB</LanguageCountryCode>
  </InvoiceLanguage>
  <CommunicationLanguage>
    <LanguageCode>en</LanguageCode>
    <LanguageCountryCode>GB</LanguageCountryCode>
  </CommunicationLanguage>
  <CalculationDecimalPlaces/>
  <PreviousInvoiceTaxCountry/>
  <TaxDecisionSet>
     <TaxDecisionSetId/>
     <SellerTaxIndicator>
       <TaxIndicatorAbbreviation>MAT_DOM</TaxIndicatorAbbreviation>
       <TaxIndicatorName>Domestic Tax</TaxIndicatorName>
       <TaxIndicatorComment>Domestic transaction</TaxIndicatorComment>
     </SellerTaxIndicator>
     <SellerTaxCountry>NULL</SellerTaxCountry>
     <SellerTaxState>NULL</SellerTaxState>
     <BuyerTaxIndicator>
        <TaxIndicatorAbbreviation>MAT_DOM</TaxIndicatorAbbreviation>
        <TaxIndicatorName>Domestic Tax</TaxIndicatorName>
        <TaxIndicatorComment>Domestic transaction</TaxIndicatorComment>
     </BuyerTaxIndicator>
     <BuyerTaxCountry>NULL</BuyerTaxCountry>
     <BuyerTaxState>NULL</BuyerTaxState>
     <CombinedTaxIndicator>DOM</CombinedTaxIndicator>
     <CommercialIndicator>C</CommercialIndicator>
     <SellerTaxRegCountry>DE</SellerTaxRegCountry>
     <SellerTaxRegState>NULL</SellerTaxRegState>
     <BuyerTaxRegCountry>DE</BuyerTaxRegCountry>
     <BuyerTaxRegState>NULL</BuyerTaxRegState> 
    <TaxComment>
      <TaxCommentType/>
      <TaxCommentText/>
    </TaxComment>
    <InvoiceCurrency>
      <CurrencyCode>EUR</CurrencyCode>
      <SellerLocalTaxCurrencyCode/>
      <BuyerLocalTaxCurrencyCode/>
    </InvoiceCurrency>
    <LegalTaxCalculationLevel>G</LegalTaxCalculationLevel>
    <TaxInvoiceLine>
      <LineNumber>1</LineNumber>
      <ItemNo>1</ItemNo>
      <ItemType/>
      <UNSPSC>56000000</UNSPSC>
      <Classification/>
      <SubClassification/>
      <CountryItemClassification/>
      <NetAmount>10.00</NetAmount>
      
      <VariableTaxSteeringInput>
        <ConsignorCountry/>
        <ConsignorState/>
        <ConsignorBusinessUnitCode/>
        <ConsignorBusinessUnitType/>
        <ConsigneeCountry/>
        <ConsigneeState/>
        <ConsigneeBusinessUnitCode/>
        <ConsigneeBusinessUnitType/>
        <CarrierCountry/>
        <CarrierState/>
        <CarrierBusinessUnitCode/>
        <CarrierBusinessUnitType/>
        <ShipmentStartCountry/>
        <ShipmentEndCountry/>
        <ShipmentStartState/>
        <ShipmentEndState/>
        <ServiceRenderedCountry/>
        <ServiceRenderedState/>
        <ResalePurpose/>
        <IsOutBonded/>
        <IsInBonded/>
        <TaxPreAlgorithmOutput>
          <IsExport/>
          <IsImport/>
          <IsExported/>
          <IsImported/>
        </TaxPreAlgorithmOutput>
        <ShippingOfCustomsClearedGoods/>
      </VariableTaxSteeringInput>
      </TaxInvoiceLine>
     <TaxInvoiceLine>
      <LineNumber>2</LineNumber>
      <ItemNo>1</ItemNo>
      <ItemType/>
      <UNSPSC>10000000</UNSPSC>
      <Classification/>
      <SubClassification/>
      <CountryItemClassification/>
      <NetAmount>10.00</NetAmount>
      
      <VariableTaxSteeringInput>
        <ConsignorCountry/>
        <ConsignorState/>
        <ConsignorBusinessUnitCode/>
        <ConsignorBusinessUnitType/>
        <ConsigneeCountry/>
        <ConsigneeState/>
        <ConsigneeBusinessUnitCode/>
        <ConsigneeBusinessUnitType/>
        <CarrierCountry/>
        <CarrierState/>
        <CarrierBusinessUnitCode/>
        <CarrierBusinessUnitType/>
        <ShipmentStartCountry/>
        <ShipmentEndCountry/>
        <ShipmentStartState/>
        <ShipmentEndState/>
        <ServiceRenderedCountry/>
        <ServiceRenderedState/>
        <ResalePurpose/>
        <IsOutBonded/>
        <IsInBonded/>
        <TaxPreAlgorithmOutput>
          <IsExport/>
          <IsImport/>
          <IsExported/>
          <IsImported/>
        </TaxPreAlgorithmOutput>
        <ShippingOfCustomsClearedGoods/>
      </VariableTaxSteeringInput>
     
    </TaxInvoiceLine>
  </TaxDecisionSet>
  <TaxDate>
    <TaxAlgorithmDate>2013-09-12</TaxAlgorithmDate>
    <TaxCalculationDate/>
  </TaxDate>
  <TaxModuleBehaviour>
    <SkipCalculation>N</SkipCalculation>
    <SkipDecision>Y</SkipDecision>
  </TaxModuleBehaviour>
  <VariableTaxSteeringInput>
    <ConsignorCountry>DE</ConsignorCountry>
    <ConsignorState/>
    <ConsignorBusinessUnitCode>1206</ConsignorBusinessUnitCode>
    <ConsignorBusinessUnitType>COM</ConsignorBusinessUnitType>
    <ConsigneeCountry>DE</ConsigneeCountry>
    <ConsigneeState/>
    <ConsigneeBusinessUnitCode>1206</ConsigneeBusinessUnitCode>
    <ConsigneeBusinessUnitType>COM</ConsigneeBusinessUnitType>
    <CarrierCountry/>
    <CarrierState/>
    <CarrierBusinessUnitCode/>
    <CarrierBusinessUnitType/>
    <ShipmentStartCountry/>
    <ShipmentEndCountry/>
    <ShipmentStartState/>
    <ShipmentEndState/>
    <ServiceRenderedCountry/>
    <ServiceRenderedState/>
    <ResalePurpose>Y</ResalePurpose>
    <IsOutBonded>N</IsOutBonded>
    <IsInBonded>N</IsInBonded>
    <TaxPreAlgorithmOutput>
      <IsExport>N</IsExport>
      <IsImport>N</IsImport>
      <IsExported>N</IsExported>
      <IsImported>N</IsImported>
    </TaxPreAlgorithmOutput>
    <ShippingOfCustomsClearedGoods/>
  </VariableTaxSteeringInput>
  <BuyerParty>
    <Party>
      <BusinessUnitCode>1206</BusinessUnitCode>
      <BusinessUnitType>COM</BusinessUnitType>
      <BusinessUnitName>RETAIL CENTERS MANAGEMENT</BusinessUnitName>
     <PartyAddress>
        <AddressType/>
        <City/>
        <PostBox/>
        <Street/>
        <ZipCode/>
        <CountryCode>DE</CountryCode>
        <StateCode/>
        <CountryOfLegalRegistration/>
      </PartyAddress>
    </Party>
   
  </BuyerParty>
  <SellerParty>
    <Party>
      <BusinessUnitCode>1206</BusinessUnitCode>
      <BusinessUnitType>COM</BusinessUnitType>
      <BusinessUnitName>IKEA STIFTUNG</BusinessUnitName>
       <PartyAddress>
        <AddressType/>
        <City/>
        <PostBox/>
        <Street/>
        <ZipCode/>
        <CountryCode>DE</CountryCode>
        <StateCode/>
        <CountryOfLegalRegistration/>
      </PartyAddress>
    </Party>
    
  </SellerParty>
  <TermOfDelivery>DDU</TermOfDelivery></arg0>
      </ws:applyTax>
   </soap:Body>
</soap:Envelope>